**Free
//this is the comment line added from the remote repo
dcl-s counter int(3);
dcl-c quote '''';
dcl-s loopcount packed(4 0);
dsply 'hello Github';
*inlr = *main;

dcl-proc;
 dcl-pi *n;
 end-pi;
 dsply 'hello';
 return;
 end proc;